In [2]:
import numpy as np
import pandas as pd

In [21]:
# dict into list : in dict into list the keys of dictionary work as a be columns 
df1={
    "Names" : ["Sadiq shah" , "Ali Baksh" , "Faizaan" , "Kahisf"] ,
    "Degree": ["BScs" , "10th" , "BScs" , "Bscs"],
    "COntact No" : [22435346,6867978,67869898,769877]
    
    
}
data=pd.DataFrame(df1)
data

        Names Degree  COntact No
0  Sadiq shah   BScs    22435346
1   Ali Baksh   10th     6867978
2     Faizaan   BScs    67869898
3      Kahisf   Bscs      769877

In [22]:
df2={
     "Karachi_2016" : 3446345545,
    "Karachi_2017" : 3446344445,
    "Karachi_2018" : 344634533445,
    "Karachi_2019" : 344634554343,   
}
years=[2016,2017,2018,2019]
data=pd.DataFrame(df2,years)
data

      Karachi_2016  Karachi_2017  Karachi_2018  Karachi_2019
2016    3446345545    3446344445  344634533445  344634554343
2017    3446345545    3446344445  344634533445  344634554343
2018    3446345545    3446344445  344634533445  344634554343
2019    3446345545    3446344445  344634533445  344634554343

In [59]:
data={
    "Roll_NO" : pd.Series([34,65,34,34,67,56]),
    "Names"  : pd.Series(["Sadiq","Zara",'Amna',"Saim","Kiran"])
    
}
df=pd.DataFrame(data)
df

   Roll_NO  Names
0       34  Sadiq
1       65   Zara
2       34   Amna
3       34   Saim
4       67  Kiran
5       56    NaN

In [68]:
#dic to dic
data={
    
        "Pakistan" : {"Country1" : 'Khi'},
          #columns      index        value
        "INdia"  : {"Country2" : 'Bomby'},
       "Bangla Desh"  : {"Country3" : 'Dhaka'}
    
}

dic_to_dic=pd.DataFrame(data)
dic_to_dic

         Pakistan  INdia Bangla Desh
Country1      Khi    NaN         NaN
Country2      NaN  Bomby         NaN
Country3      NaN    NaN       Dhaka

In [62]:
d